{
	"weightsManifest": [{
			"paths": ["group1-shard1of1"],
			"weights": [{
					"name": "batch_normalization_1/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_1/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_1/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_1/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group2-shard1of1"],
			"weights": [{
					"name": "batch_normalization_2/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_2/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_2/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_2/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group3-shard1of1"],
			"weights": [{
					"name": "batch_normalization_3/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_3/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_3/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_3/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group4-shard1of1"],
			"weights": [{
					"name": "batch_normalization_4/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_4/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_4/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_4/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group5-shard1of1"],
			"weights": [{
					"name": "batch_normalization_5/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_5/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_5/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_5/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group6-shard1of1"],
			"weights": [{
					"name": "batch_normalization_6/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_6/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_6/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_6/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group7-shard1of1"],
			"weights": [{
					"name": "batch_normalization_7/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_7/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_7/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_7/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group8-shard1of1"],
			"weights": [{
					"name": "batch_normalization_8/gamma",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_8/beta",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_8/moving_mean",
					"dtype": "float32",
					"shape": [64]
				}, {
					"name": "batch_normalization_8/moving_variance",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group9-shard1of1"],
			"weights": [{
					"name": "conv2d_1/kernel",
					"dtype": "float32",
					"shape": [3, 3, 1, 64]
				}, {
					"name": "conv2d_1/bias",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group10-shard1of1"],
			"weights": [{
					"name": "conv2d_10/kernel",
					"dtype": "float32",
					"shape": [1, 1, 64, 1]
				}, {
					"name": "conv2d_10/bias",
					"dtype": "float32",
					"shape": [1]
				}
			]
		}, {
			"paths": ["group11-shard1of1"],
			"weights": [{
					"name": "conv2d_2/kernel",
					"dtype": "float32",
					"shape": [3, 3, 64, 64]
				}, {
					"name": "conv2d_2/bias",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group12-shard1of1"],
			"weights": [{
					"name": "conv2d_3/kernel",
					"dtype": "float32",
					"shape": [3, 3, 64, 64]
				}, {
					"name": "conv2d_3/bias",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group13-shard1of1"],
			"weights": [{
					"name": "conv2d_4/kernel",
					"dtype": "float32",
					"shape": [3, 3, 64, 64]
				}, {
					"name": "conv2d_4/bias",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group14-shard1of1"],
			"weights": [{
					"name": "conv2d_5/kernel",
					"dtype": "float32",
					"shape": [3, 3, 64, 64]
				}, {
					"name": "conv2d_5/bias",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group15-shard1of1"],
			"weights": [{
					"name": "conv2d_6/kernel",
					"dtype": "float32",
					"shape": [3, 3, 64, 64]
				}, {
					"name": "conv2d_6/bias",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group16-shard1of1"],
			"weights": [{
					"name": "conv2d_7/kernel",
					"dtype": "float32",
					"shape": [3, 3, 64, 64]
				}, {
					"name": "conv2d_7/bias",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group17-shard1of1"],
			"weights": [{
					"name": "conv2d_8/kernel",
					"dtype": "float32",
					"shape": [3, 3, 64, 64]
				}, {
					"name": "conv2d_8/bias",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}, {
			"paths": ["group18-shard1of1"],
			"weights": [{
					"name": "conv2d_9/kernel",
					"dtype": "float32",
					"shape": [3, 3, 64, 64]
				}, {
					"name": "conv2d_9/bias",
					"dtype": "float32",
					"shape": [64]
				}
			]
		}
	],
	"modelTopology": {
		"keras_version": "2.1.5",
		"model_config": {
			"config": {
				"name": "model_1",
				"layers": [{
						"name": "input_1",
						"inbound_nodes": [],
						"config": {
							"dtype": "float32",
							"batch_input_shape": [null, null, null, 1],
							"name": "input_1",
							"sparse": false
						},
						"class_name": "InputLayer"
					}, {
						"name": "conv2d_1",
						"inbound_nodes": [[["input_1", 0, 0, {}
								]]],
						"config": {
							"name": "conv2d_1",
							"kernel_initializer": {
								"config": {
									"scale": 1.0,
									"seed": null,
									"mode": "fan_avg",
									"distribution": "uniform"
								},
								"class_name": "VarianceScaling"
							},
							"kernel_regularizer": null,
							"trainable": true,
							"kernel_constraint": null,
							"bias_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"use_bias": true,
							"activity_regularizer": null,
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"strides": [1, 1],
							"bias_constraint": null,
							"padding": "same",
							"bias_regularizer": null,
							"activation": "relu",
							"kernel_size": [3, 3],
							"filters": 64
						},
						"class_name": "Conv2D"
					}, {
						"name": "conv2d_2",
						"inbound_nodes": [[["conv2d_1", 0, 0, {}
								]]],
						"config": {
							"name": "conv2d_2",
							"kernel_initializer": {
								"config": {
									"scale": 1.0,
									"seed": null,
									"mode": "fan_avg",
									"distribution": "uniform"
								},
								"class_name": "VarianceScaling"
							},
							"kernel_regularizer": null,
							"trainable": true,
							"kernel_constraint": null,
							"bias_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"use_bias": true,
							"activity_regularizer": null,
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"strides": [1, 1],
							"bias_constraint": null,
							"padding": "same",
							"bias_regularizer": null,
							"activation": "linear",
							"kernel_size": [3, 3],
							"filters": 64
						},
						"class_name": "Conv2D"
					}, {
						"name": "batch_normalization_1",
						"inbound_nodes": [[["conv2d_2", 0, 0, {}
								]]],
						"config": {
							"name": "batch_normalization_1",
							"scale": true,
							"epsilon": 0.001,
							"moving_mean_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"gamma_initializer": {
								"config": {},
								"class_name": "Ones"
							},
							"beta_regularizer": null,
							"beta_constraint": null,
							"trainable": true,
							"gamma_regularizer": null,
							"gamma_constraint": null,
							"beta_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"momentum": 0.99,
							"axis": -1,
							"center": true,
							"moving_variance_initializer": {
								"config": {},
								"class_name": "Ones"
							}
						},
						"class_name": "BatchNormalization"
					}, {
						"name": "activation_1",
						"inbound_nodes": [[["batch_normalization_1", 0, 0, {}
								]]],
						"config": {
							"name": "activation_1",
							"activation": "relu",
							"trainable": true
						},
						"class_name": "Activation"
					}, {
						"name": "conv2d_3",
						"inbound_nodes": [[["activation_1", 0, 0, {}
								]]],
						"config": {
							"name": "conv2d_3",
							"kernel_initializer": {
								"config": {
									"scale": 1.0,
									"seed": null,
									"mode": "fan_avg",
									"distribution": "uniform"
								},
								"class_name": "VarianceScaling"
							},
							"kernel_regularizer": null,
							"trainable": true,
							"kernel_constraint": null,
							"bias_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"use_bias": true,
							"activity_regularizer": null,
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"strides": [1, 1],
							"bias_constraint": null,
							"padding": "same",
							"bias_regularizer": null,
							"activation": "linear",
							"kernel_size": [3, 3],
							"filters": 64
						},
						"class_name": "Conv2D"
					}, {
						"name": "batch_normalization_2",
						"inbound_nodes": [[["conv2d_3", 0, 0, {}
								]]],
						"config": {
							"name": "batch_normalization_2",
							"scale": true,
							"epsilon": 0.001,
							"moving_mean_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"gamma_initializer": {
								"config": {},
								"class_name": "Ones"
							},
							"beta_regularizer": null,
							"beta_constraint": null,
							"trainable": true,
							"gamma_regularizer": null,
							"gamma_constraint": null,
							"beta_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"momentum": 0.99,
							"axis": -1,
							"center": true,
							"moving_variance_initializer": {
								"config": {},
								"class_name": "Ones"
							}
						},
						"class_name": "BatchNormalization"
					}, {
						"name": "add_1",
						"inbound_nodes": [[["conv2d_1", 0, 0, {}
								], ["batch_normalization_2", 0, 0, {}
								]]],
						"config": {
							"name": "add_1",
							"trainable": true
						},
						"class_name": "Add"
					}, {
						"name": "activation_2",
						"inbound_nodes": [[["add_1", 0, 0, {}
								]]],
						"config": {
							"name": "activation_2",
							"activation": "relu",
							"trainable": true
						},
						"class_name": "Activation"
					}, {
						"name": "conv2d_4",
						"inbound_nodes": [[["activation_2", 0, 0, {}
								]]],
						"config": {
							"name": "conv2d_4",
							"kernel_initializer": {
								"config": {
									"scale": 1.0,
									"seed": null,
									"mode": "fan_avg",
									"distribution": "uniform"
								},
								"class_name": "VarianceScaling"
							},
							"kernel_regularizer": null,
							"trainable": true,
							"kernel_constraint": null,
							"bias_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"use_bias": true,
							"activity_regularizer": null,
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"strides": [1, 1],
							"bias_constraint": null,
							"padding": "same",
							"bias_regularizer": null,
							"activation": "linear",
							"kernel_size": [3, 3],
							"filters": 64
						},
						"class_name": "Conv2D"
					}, {
						"name": "batch_normalization_3",
						"inbound_nodes": [[["conv2d_4", 0, 0, {}
								]]],
						"config": {
							"name": "batch_normalization_3",
							"scale": true,
							"epsilon": 0.001,
							"moving_mean_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"gamma_initializer": {
								"config": {},
								"class_name": "Ones"
							},
							"beta_regularizer": null,
							"beta_constraint": null,
							"trainable": true,
							"gamma_regularizer": null,
							"gamma_constraint": null,
							"beta_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"momentum": 0.99,
							"axis": -1,
							"center": true,
							"moving_variance_initializer": {
								"config": {},
								"class_name": "Ones"
							}
						},
						"class_name": "BatchNormalization"
					}, {
						"name": "activation_3",
						"inbound_nodes": [[["batch_normalization_3", 0, 0, {}
								]]],
						"config": {
							"name": "activation_3",
							"activation": "relu",
							"trainable": true
						},
						"class_name": "Activation"
					}, {
						"name": "conv2d_5",
						"inbound_nodes": [[["activation_3", 0, 0, {}
								]]],
						"config": {
							"name": "conv2d_5",
							"kernel_initializer": {
								"config": {
									"scale": 1.0,
									"seed": null,
									"mode": "fan_avg",
									"distribution": "uniform"
								},
								"class_name": "VarianceScaling"
							},
							"kernel_regularizer": null,
							"trainable": true,
							"kernel_constraint": null,
							"bias_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"use_bias": true,
							"activity_regularizer": null,
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"strides": [1, 1],
							"bias_constraint": null,
							"padding": "same",
							"bias_regularizer": null,
							"activation": "linear",
							"kernel_size": [3, 3],
							"filters": 64
						},
						"class_name": "Conv2D"
					}, {
						"name": "batch_normalization_4",
						"inbound_nodes": [[["conv2d_5", 0, 0, {}
								]]],
						"config": {
							"name": "batch_normalization_4",
							"scale": true,
							"epsilon": 0.001,
							"moving_mean_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"gamma_initializer": {
								"config": {},
								"class_name": "Ones"
							},
							"beta_regularizer": null,
							"beta_constraint": null,
							"trainable": true,
							"gamma_regularizer": null,
							"gamma_constraint": null,
							"beta_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"momentum": 0.99,
							"axis": -1,
							"center": true,
							"moving_variance_initializer": {
								"config": {},
								"class_name": "Ones"
							}
						},
						"class_name": "BatchNormalization"
					}, {
						"name": "add_2",
						"inbound_nodes": [[["activation_2", 0, 0, {}
								], ["batch_normalization_4", 0, 0, {}
								]]],
						"config": {
							"name": "add_2",
							"trainable": true
						},
						"class_name": "Add"
					}, {
						"name": "activation_4",
						"inbound_nodes": [[["add_2", 0, 0, {}
								]]],
						"config": {
							"name": "activation_4",
							"activation": "relu",
							"trainable": true
						},
						"class_name": "Activation"
					}, {
						"name": "conv2d_6",
						"inbound_nodes": [[["activation_4", 0, 0, {}
								]]],
						"config": {
							"name": "conv2d_6",
							"kernel_initializer": {
								"config": {
									"scale": 1.0,
									"seed": null,
									"mode": "fan_avg",
									"distribution": "uniform"
								},
								"class_name": "VarianceScaling"
							},
							"kernel_regularizer": null,
							"trainable": true,
							"kernel_constraint": null,
							"bias_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"use_bias": true,
							"activity_regularizer": null,
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"strides": [1, 1],
							"bias_constraint": null,
							"padding": "same",
							"bias_regularizer": null,
							"activation": "linear",
							"kernel_size": [3, 3],
							"filters": 64
						},
						"class_name": "Conv2D"
					}, {
						"name": "batch_normalization_5",
						"inbound_nodes": [[["conv2d_6", 0, 0, {}
								]]],
						"config": {
							"name": "batch_normalization_5",
							"scale": true,
							"epsilon": 0.001,
							"moving_mean_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"gamma_initializer": {
								"config": {},
								"class_name": "Ones"
							},
							"beta_regularizer": null,
							"beta_constraint": null,
							"trainable": true,
							"gamma_regularizer": null,
							"gamma_constraint": null,
							"beta_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"momentum": 0.99,
							"axis": -1,
							"center": true,
							"moving_variance_initializer": {
								"config": {},
								"class_name": "Ones"
							}
						},
						"class_name": "BatchNormalization"
					}, {
						"name": "activation_5",
						"inbound_nodes": [[["batch_normalization_5", 0, 0, {}
								]]],
						"config": {
							"name": "activation_5",
							"activation": "relu",
							"trainable": true
						},
						"class_name": "Activation"
					}, {
						"name": "conv2d_7",
						"inbound_nodes": [[["activation_5", 0, 0, {}
								]]],
						"config": {
							"name": "conv2d_7",
							"kernel_initializer": {
								"config": {
									"scale": 1.0,
									"seed": null,
									"mode": "fan_avg",
									"distribution": "uniform"
								},
								"class_name": "VarianceScaling"
							},
							"kernel_regularizer": null,
							"trainable": true,
							"kernel_constraint": null,
							"bias_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"use_bias": true,
							"activity_regularizer": null,
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"strides": [1, 1],
							"bias_constraint": null,
							"padding": "same",
							"bias_regularizer": null,
							"activation": "linear",
							"kernel_size": [3, 3],
							"filters": 64
						},
						"class_name": "Conv2D"
					}, {
						"name": "batch_normalization_6",
						"inbound_nodes": [[["conv2d_7", 0, 0, {}
								]]],
						"config": {
							"name": "batch_normalization_6",
							"scale": true,
							"epsilon": 0.001,
							"moving_mean_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"gamma_initializer": {
								"config": {},
								"class_name": "Ones"
							},
							"beta_regularizer": null,
							"beta_constraint": null,
							"trainable": true,
							"gamma_regularizer": null,
							"gamma_constraint": null,
							"beta_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"momentum": 0.99,
							"axis": -1,
							"center": true,
							"moving_variance_initializer": {
								"config": {},
								"class_name": "Ones"
							}
						},
						"class_name": "BatchNormalization"
					}, {
						"name": "add_3",
						"inbound_nodes": [[["activation_4", 0, 0, {}
								], ["batch_normalization_6", 0, 0, {}
								]]],
						"config": {
							"name": "add_3",
							"trainable": true
						},
						"class_name": "Add"
					}, {
						"name": "activation_6",
						"inbound_nodes": [[["add_3", 0, 0, {}
								]]],
						"config": {
							"name": "activation_6",
							"activation": "relu",
							"trainable": true
						},
						"class_name": "Activation"
					}, {
						"name": "conv2d_8",
						"inbound_nodes": [[["activation_6", 0, 0, {}
								]]],
						"config": {
							"name": "conv2d_8",
							"kernel_initializer": {
								"config": {
									"scale": 1.0,
									"seed": null,
									"mode": "fan_avg",
									"distribution": "uniform"
								},
								"class_name": "VarianceScaling"
							},
							"kernel_regularizer": null,
							"trainable": true,
							"kernel_constraint": null,
							"bias_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"use_bias": true,
							"activity_regularizer": null,
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"strides": [1, 1],
							"bias_constraint": null,
							"padding": "same",
							"bias_regularizer": null,
							"activation": "linear",
							"kernel_size": [3, 3],
							"filters": 64
						},
						"class_name": "Conv2D"
					}, {
						"name": "batch_normalization_7",
						"inbound_nodes": [[["conv2d_8", 0, 0, {}
								]]],
						"config": {
							"name": "batch_normalization_7",
							"scale": true,
							"epsilon": 0.001,
							"moving_mean_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"gamma_initializer": {
								"config": {},
								"class_name": "Ones"
							},
							"beta_regularizer": null,
							"beta_constraint": null,
							"trainable": true,
							"gamma_regularizer": null,
							"gamma_constraint": null,
							"beta_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"momentum": 0.99,
							"axis": -1,
							"center": true,
							"moving_variance_initializer": {
								"config": {},
								"class_name": "Ones"
							}
						},
						"class_name": "BatchNormalization"
					}, {
						"name": "activation_7",
						"inbound_nodes": [[["batch_normalization_7", 0, 0, {}
								]]],
						"config": {
							"name": "activation_7",
							"activation": "relu",
							"trainable": true
						},
						"class_name": "Activation"
					}, {
						"name": "conv2d_9",
						"inbound_nodes": [[["activation_7", 0, 0, {}
								]]],
						"config": {
							"name": "conv2d_9",
							"kernel_initializer": {
								"config": {
									"scale": 1.0,
									"seed": null,
									"mode": "fan_avg",
									"distribution": "uniform"
								},
								"class_name": "VarianceScaling"
							},
							"kernel_regularizer": null,
							"trainable": true,
							"kernel_constraint": null,
							"bias_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"use_bias": true,
							"activity_regularizer": null,
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"strides": [1, 1],
							"bias_constraint": null,
							"padding": "same",
							"bias_regularizer": null,
							"activation": "linear",
							"kernel_size": [3, 3],
							"filters": 64
						},
						"class_name": "Conv2D"
					}, {
						"name": "batch_normalization_8",
						"inbound_nodes": [[["conv2d_9", 0, 0, {}
								]]],
						"config": {
							"name": "batch_normalization_8",
							"scale": true,
							"epsilon": 0.001,
							"moving_mean_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"gamma_initializer": {
								"config": {},
								"class_name": "Ones"
							},
							"beta_regularizer": null,
							"beta_constraint": null,
							"trainable": true,
							"gamma_regularizer": null,
							"gamma_constraint": null,
							"beta_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"momentum": 0.99,
							"axis": -1,
							"center": true,
							"moving_variance_initializer": {
								"config": {},
								"class_name": "Ones"
							}
						},
						"class_name": "BatchNormalization"
					}, {
						"name": "add_4",
						"inbound_nodes": [[["activation_6", 0, 0, {}
								], ["batch_normalization_8", 0, 0, {}
								]]],
						"config": {
							"name": "add_4",
							"trainable": true
						},
						"class_name": "Add"
					}, {
						"name": "activation_8",
						"inbound_nodes": [[["add_4", 0, 0, {}
								]]],
						"config": {
							"name": "activation_8",
							"activation": "relu",
							"trainable": true
						},
						"class_name": "Activation"
					}, {
						"name": "conv2d_10",
						"inbound_nodes": [[["activation_8", 0, 0, {}
								]]],
						"config": {
							"name": "conv2d_10",
							"kernel_initializer": {
								"config": {
									"scale": 1.0,
									"seed": null,
									"mode": "fan_avg",
									"distribution": "uniform"
								},
								"class_name": "VarianceScaling"
							},
							"kernel_regularizer": null,
							"trainable": true,
							"kernel_constraint": null,
							"bias_initializer": {
								"config": {},
								"class_name": "Zeros"
							},
							"use_bias": true,
							"activity_regularizer": null,
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"strides": [1, 1],
							"bias_constraint": null,
							"padding": "same",
							"bias_regularizer": null,
							"activation": "tanh",
							"kernel_size": [1, 1],
							"filters": 1
						},
						"class_name": "Conv2D"
					}
				],
				"output_layers": [["conv2d_10", 0, 0]],
				"input_layers": [["input_1", 0, 0]]
			},
			"class_name": "Model"
		},
		"backend": "tensorflow"
	}
}
